import pandas as pd

# 创建data
data = [
    [20, '男'],
    [22, '女'],
    [23, '女'],
    [27, '男'],
    [25, '女']
]

columns = ['年龄', '性别']
index = pd.Index(['张三', '李四', '王五', '陈六', '唐七'])
s = pd.DataFrame(data=data, index=index, columns=columns)
print(s)
print('------------添加行-----------------')
s.loc['张小二'] = [18, '男']
print(s)
print('-----------添加列----------')
s['成绩'] = [78, 89, 48, 100, 88, 95]
print(s)
print('------------修改数据-------------')
s.iloc[0:3, 2] = 60  # 和s.iloc[0:3,2]=[60,60,60]的效果一样,通过隐式索引进行修改
print(s)
s.loc['李四', '成绩'] = 99  # 通过显示索引进行修改
print(s)
print('------------修改列的顺序--------------')
s = s[['性别', '年龄', '成绩']]
print(s)
print('------------------------')
print(s.loc['张三'])
print(s.loc[['张三', '李四'], ['年龄', '成绩']])
print(s.iloc[::-1])  # 反向索引
print('--------------------------')
print(s['成绩'])
print(s.成绩)
print('--------------广播 去添加列-----------------')
s['证件类型']='二代身份证'
print(s)
s.pop('证件类型')
print(s)
print('--------不改变原数组 的添加列------------')
print(s.assign(证件类型=['二代身份证','二代身份证','二代身份证','二代身份证','二代身份证','二代身份证']))
print(s)
